myinit.org
* Hydra - a powerful tool
  [[https://github.com/abo-abo/hydra][Hydra]]

#+BEGIN_SRC emacs-lisp
;  (use-package hydra
;    :ensure t
;    :init
;    (global-set-key
;     (kbd "C-x t")
;     (defhydra toggle (:color blue)
;       "toggle"
;       ("a" abbrev-mode "abbrev")
;       ("s" flyspell-mode "flyspell")
;       ("d" toggle-debug-on-error "debug")
;       ("c" fci-mode "fCi")
;       ("f" auto-fill-mode "fill")
;       ("t" toggle-truncate-lines "truncate")
;       ("w" whitespace-mode "whitespace")
;       ("q" nil "cancel")))
;    (global-set-key
;       (kbd "C-x j")
;       (defhydra gotoline 
;       (:pre (linum-mode 1)
;       :post (linum-mode -1))
;       "goto"
;       ("t" (lambda () (interactive)(move-to-window-line-top-bottom 0)) "top")
;       ("b" (lambda () (interactive)(move-to-window-line-top-bottom -1)) "bottom")
;       ("m" (lambda () (interactive)(move-to-window-line-top-bottom)) "middle")
;       ("e" (lambda () (interactive)(end-of-buffer)) "end")
;       ("c" recenter-top-bottom "recenter")
;       ("n" next-line "down")
;       ("p" (lambda () (interactive) (forward-line -1))  "up")
;       ("g" goto-line "goto-line")
;       ))
;    (global-set-key
;     (kbd "C-c t")
;     (defhydra hydra-global-org (:color blue)
;       "Org"
;       ("t" org-timer-start "Start Timer")
;       ("s" org-timer-stop "Stop Timer")
;       ("r" org-timer-set-timer "Set Timer") ; This one requires you be in an orgmode doc, as it sets the timer for the header
;       ("p" org-timer "Print Timer") ; output timer value to buffer
;       ("w" (org-clock-in '(4)) "Clock-In") ; used with (org-clock-persistence-insinuate) (setq org-clock-persist t)
;       ("o" org-clock-out "Clock-Out") ; you might also want (setq org-log-note-clock-out t)
;       ("j" org-clock-goto "Clock Goto") ; global visit the clocked task
;       ("c" org-capture "Capture") ; Don't forget to define the captures you want http://orgmode.org/manual/Capture.html
;       ("l" (or )rg-capture-goto-last-stored "Last Capture"))
;     ))
;#+END_SRC
* Ag
  #+BEGIN_SRC emacs-lisp
    (use-package ag
      :ensure t)
  #+END_SRC
* Projectile and Dump Jump
  Other solution:
  - [[https://github.com/redguardtoo/find-file-in-project][find-file-in-project]]
  - [[https://github.com/redguardtoo/counsel-etags][counsel-etags]]
** [[https://github.com/bbatsov/projectile][projectile]]

   #+BEGIN_SRC emacs-lisp
     (use-package projectile
       :ensure t
       :bind ("C-c p" . projectile-command-map)
       :config
       (projectile-global-mode)
       (setq projectile-completion-system 'ivy))
   #+END_SRC

** [[https://github.com/jacktasia/dumb-jump][dumb-jump]]

   #+BEGIN_SRC emacs-lisp
     ;(use-package dumb-jump
     ;  :bind (("M-g o" . dumb-jump-go-other-window)
     ;	 ("M-g j" . xref-find-definitions)
     ;	 ("M-g x" . dumb-jump-go-prefer-external)
     ;	 ("M-g z" . dumb-jump-go-prefer-external-other-window))
     ;  :config 
     ;  ;; (setq dumb-jump-selector 'ivy) ;; (setq dumb-jump-selector 'helm)
     ;  :init
     ;  (dumb-jump-mode)
     ;  :ensure)
   #+END_SRC

* Emacs File Explorer
** Treemacs - a tree layout file explorer for Emacs
   [[https://github.com/Alexander-Miller/treemacs][treemacs]]

#+BEGIN_SRC emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
	    treemacs-deferred-git-apply-delay      0.5
	    treemacs-directory-name-transformer    #'identity
	    treemacs-display-in-side-window        t
	    treemacs-eldoc-display                 t
	    treemacs-file-event-delay              5000
	    treemacs-file-extension-regex          treemacs-last-period-regex-value
	    treemacs-file-follow-delay             0.2
	    treemacs-file-name-transformer         #'identity
	    treemacs-follow-after-init             t
	    treemacs-expand-after-init             t
	    treemacs-git-command-pipe              ""
	    treemacs-goto-tag-strategy             'refetch-index
	    treemacs-indentation                   2
	    treemacs-indentation-string            " "
	    treemacs-is-never-other-window         nil
	    treemacs-max-git-entries               5000
	    treemacs-missing-project-action        'ask
	    treemacs-move-forward-on-expand        nil
	    treemacs-no-png-images                 nil
	    treemacs-no-delete-other-windows       t
	    treemacs-project-follow-cleanup        nil
	    treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
	    treemacs-position                      'left
	    treemacs-read-string-input             'from-child-frame
	    treemacs-recenter-distance             0.1
	    treemacs-recenter-after-file-follow    nil
	    treemacs-recenter-after-tag-follow     nil
	    treemacs-recenter-after-project-jump   'always
	    treemacs-recenter-after-project-expand 'on-distance
	    treemacs-litter-directories            '("/node_modules" "/.venv" "/.cask")
	    treemacs-show-cursor                   nil
	    treemacs-show-hidden-files             t
	    treemacs-silent-filewatch              nil
	    treemacs-silent-refresh                nil
	    treemacs-sorting                       'alphabetic-asc
	    treemacs-space-between-root-nodes      t
	    treemacs-tag-follow-cleanup            t
	    treemacs-tag-follow-delay              1.5
	    treemacs-user-mode-line-format         nil
	    treemacs-user-header-line-format       nil
	    treemacs-width                         35
	    treemacs-width-is-initially-locked     t
	    treemacs-workspace-switch-cleanup      nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (pcase (cons (not (null (executable-find "git")))
		   (not (null treemacs-python-executable)))
	(`(t . t)
	 (treemacs-git-mode 'deferred))
	(`(t . _)
	 (treemacs-git-mode 'simple))))
    :bind
    (:map global-map
	  ("M-0"       . treemacs-select-window)
	  ("C-x t 1"   . treemacs-delete-other-windows)
	  ("C-x t t"   . treemacs)
	  ("C-x t B"   . treemacs-bookmark)
	  ("C-x t C-t" . treemacs-find-file)
	  ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :after (treemacs dired)
    :ensure t
    :config (treemacs-icons-dired-mode))

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    :after (treemacs persp-mode) ;;or perspective vs. persp-mode
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))
#+END_SRC

** NeoTree
   [[https://github.com/jaypei/emacs-neotree][emacs-neotree]]

* Git
** [[https://github.com/magit/magit/][magit]]
** [[https://github.com/emacsorphanage/git-gutter][git-gutter]]

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :init
    (progn
      (bind-key "C-x g" 'magit-status)
      ))

  (setq magit-status-margin
	'(t "%Y-%m-%d %H:%M " magit-log-margin-width t 18))

  (use-package git-gutter
    :ensure t
    :init
    (global-git-gutter-mode +1))
#+END_SRC

* Dired
** Setup
   #+BEGIN_SRC emacs-lisp
     (setq dired-dwim-target t)

     (use-package dired-narrow
       :ensure t
       :config
       (bind-key "C-c C-n" #'dired-narrow)
       (bind-key "C-c C-f" #'dired-narrow-fuzzy)
       (bind-key "C-x C-N" #'dired-narrow-regexp)
       )

     (use-package dired-subtree :ensure t
       :after dired
       :config
       (bind-key "<tab>" #'dired-subtree-toggle dired-mode-map)
       (bind-key "<backtab>" #'dired-subtree-cycle dired-mode-map))
   #+END_SRC
** Basic dired  
   - enter vs a
   - f to visit, v ot view
   - + to make a directory
   - m to mark
   - C copy, R rename/move, D delete
** Regex
   - mark with regex
   - t to toggle marks
   - k to hide
** Fixing regex
   [[https://github.com/joddie/pcre2el][pcre2el]] - convert between PCRE, Emacs and rx regexp syntax

   #+BEGIN_SRC emacs-lisp
     (use-package pcre2el
       :ensure t
       :config
       (pcre-mode))
   #+END_SRC

** Renaming files
   C-x C-q -- Edit dired inline
** using swiper
** wgrep
   [[https://github.com/mhayashi1120/Emacs-wgrep][wgrep]]
   #+BEGIN_SRC emacs-lisp
     (use-package wgrep
       :ensure t)

     (use-package wgrep-ag
       :ensure t)

     ; (require 'wgrep-ag)
     ; (setq counsel-fzf-cmd "~/.fzf/bin/fzf -f %s")
   #+END_SRC
* Blog
** [[https://github.com/skeeto/elfeed][elfeed]]
** [[https://github.com/jekyll/jekyll][jekyll]] - ruby based
** [[https://github.com/getnikola/nikola][Nikola]]
* Prodigy
  Manage external services from within Emacs
  [[https://github.com/rejeep/prodigy.el][Prodigy]]
* Ripgrep (rg) and Silver Searcher (ag)
  Ripgrep (rg) and Silver Searcher (ag) both perform text searches,
  and both are created to be a better and faster grep. rg is faster
  and is mainstream.
** Ripgrep
   [[https://github.com/BurntSushi/ripgrep][ripgrep (rg)]]
   [[https://github.com/dajva/rg.el][rg.el]]

   #+BEGIN_SRC emacs-lisp
     (use-package rg
       :ensure t)
   #+END_SRC

** The Silver Searcher
   [[https://github.com/ggreer/the_silver_searcher][the silver searcher (ag)]]
   [[https://github.com/Wilfred/ag.el][ag.el]]

   #+BEGIN_SRC emacs-lisp
     (use-package ag
       :ensure t)
   #+END_SRC

** Comparation
   - [[https://mariusschulz.com/blog/fast-searching-with-ripgrep][Fast Searching with ripgrep]]
   - [[https://blog.burntsushi.net/ripgrep/][ripgrep is faster than {grep, ag, git grep, ucg, pt, sift}]]
   - [[https://unix.stackexchange.com/questions/464726/how-is-ripgrep-different-from-silver-searcher-ag][how-is-ripgrep-different-from-silver-searcher-ag]]
* Theme
  install theme and use function load-theme
  - [[https://emacsthemes.com/][Emacs Themes]]
  - [[https://pawelbx.github.io/emacs-theme-gallery/][Emacs theme gallery]]
#+BEGIN_SRC emacs-lisp
  ;(load-theme 'zenburn t)
  (use-package zenburn-theme
    :ensure t
    :config (load-theme 'zenburn t))
#+END_SRC

* The rest
#+BEGIN_SRC emacs-lisp

; If you like a tabbar
;(use-package tabbar
;  :ensure t
;  :config
;  (tabbar-mode 1))

; (winner-mode 1)
; (windmove-default-keybindings)

#+END_SRC

* Macros
  [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macros.html][Keyboard Macros]]
** method one
  F3 start macro record (press F3 again, insert macro counter)
  F4 end macro record
  F4 do the macro
  
** method two
  C-x + ( start macro record
  C-x + ) end macro record
  C-x + e do the macro

* Misc packages
** setup beacon packge
   [[https://github.com/Malabarba/beacon][beacon]]

   Highlight the cursor whenever the window scrolls

** setup hungry-delete
   [[https://github.com/nflath/hungry-delete][hungry-delete]]

** setup aggressive-indent-mode
   [[https://github.com/Malabarba/aggressive-indent-mode][aggressive-indent-mode]]

** setup expand-region package
   [[https://github.com/magnars/expand-region.el][expand-region]] 

   If you expand too far, you can contract the region by pressing -
   (minus key), or by prefixing the shortcut you defined with a
   negative argument: C-- C-=

   As C-- and C-= are used by windows terminal

   Override the expand shotcut key to C-], and should use <ESC>-- C-]
   to contract the region.

** setup Delete Selection Mode
   [[https://www.emacswiki.org/emacs/DeleteSelectionMode][delete-selection-mode]]

#+BEGIN_SRC emacs-lisp
  ; highlight the select line
  (global-hl-line-mode t)

  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1))

  (use-package hungry-delete
    :ensure t
    :config
    (global-hungry-delete-mode))

  ;(use-package aggressive-indent
  ;  :ensure t
  ;  :config
  ;  (global-aggressive-indent-mode 1))

  (use-package expand-region
    :ensure t
    :config
    (global-set-key (kbd "C-]") 'er/expand-region))
#+end_SRC

* iedit and narrow / widen dwim
** setup [[https://github.com/victorhge/iedit][iedit]] package, and rebind keys
** narrow
   M-x narrow-to-region or C-x n n
** widen back
   M-x widen or C-x n w
** customize the narrow / widen dwin using function narrow-or-widen-dwim
   [[https://endlessparentheses.com/emacs-narrow-or-widen-dwim.html][Emacs narrow-or-widen-dwim]]
   C-x n into narrow, then C-x n back to widen, back and forth.
