myinit.org
** multiple-cursor
   [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]] another useful selection tool

#+BEGIN_SRC emacs-lisp
  (use-package iedit
    :ensure t
    :config
    (global-set-key (kbd "C-c ;") 'iedit-mode))

  (defun narrow-or-widen-dwim (p)
    "Widen if buffer is narrowed, narrow-dwim otherwise.
  Dwim means: region, org-src-block, org-subtree, or defun,
  whichever applies first. Narrowing to org-src-block actually
  calls `org-edit-src-code'.

  With prefix P, don't widen, just narrow even if buffer is already
  narrowed."

  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
	((region-active-p)
	 (narrow-to-region (region-beginning) (region-end)))
	((derived-mode-p 'org-mode)
	 ;; `org-edit-src-code' is not a real narrowing
	 ;; command. Remove this first conditional if
	 ;; you don't want it.
	 (cond ((ignore-errors (org-edit-src-code) t)
		(delete-other-windows))
	       ((ignore-errors (org-narrow-to-block) t))
	       (t (org-narrow-to-subtree))))
	((derived-mode-p 'latex-mode)
	 (LaTeX-narrow-to-environment))
	(t (narrow-to-defun))))

  ;; (define-key endless/toggle-map "n" #'narrow-or-widen-dwim)
  ;; This line actually replaces Emacs' entire narrowing keymap, that's
  ;; how much I like this command. Only copy it if that's what you want.
  (define-key ctl-x-map "n" #'narrow-or-widen-dwim)

  (use-package multiple-cursors
    :ensure t)
#+END_SRC
* Web mode
  - setup [[https://github.com/fxbois/web-mode][web-mode]]
  - Documentation [[https://web-mode.org/][web-mode.el]]
  - Additional package [[https://github.com/smihica/emmet-mode][emmet-mode]]

#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (setq web-mode-engines-alist
	  '(("django"    . "\\.html\\'")))
    (setq web-mode-ac-sources-alist
	  '(("css" . (ac-source-css-property))
	    ("vue" . (ac-source-words-in-buffer ac-source-abbrev))
	    ("html" . (ac-source-words-in-buffer ac-source-abbrev))))
    (setq web-mode-enable-auto-closing t)
    (setq web-mode-enable-auto-quoting t))
#+END_SRC

* Email
** mu4e
  - [[https://www.macs.hw.ac.uk/~rs46/posts/2014-01-13-mu4e-email-client.html][Drowning in Email; mu4e to the Rescue.]]
  - [[https://www.djcbsoftware.nl/code/mu/mu4e/Installation.html][install mu]]
  - [[https://gitlab.com/ambrevar/mu4e-conversation][mu4e-conversation]]
* Conditional Loading of Emacs Config
  [[https://irreal.org/blog/?p=5716][Conditional Loading of Emacs Config]]

#+BEGIN_SRC emacs-lisp
  (defun load-if-exists (f)
    "load the elisp file only if it exists and is readable"
    (if (file-readable-p f)
	(load-file f)))

  ;; load local elisp configs
  (load-if-exists "some-file.el")
#+END_SRC

* Thoughts on Emacs

  The big thing isn't so much how to do something but just to know
that something can be done and if realizing that something can be done
and then later on can look and figure out how to do it.

* Reference
  [[https://www.john2x.com/emacs.html][John's Emacs Config]]
  [[https://lorefnon.tech/2018/07/14/getting-productive-with-selection-and-navigation-in-emacs/][Getting productive with selection and navigation in Emacs]]
  [[http://irreal.org/blog/][Irreal]]
  [[http://pragmaticemacs.com/][Progmatic Emacs]]
